DAY_TYPES: dict[int, str] = {
    1: "Рабочий день",
    2: "Выходной день",
    3: "Государственный праздник"
}
WEEK_DAYS: list[str] = ["пн", "вт", "ср", "чт", "пт", "сб", "вс"]
PERIOD_TYPES: list[str] = ["Год", "Квартал", "Месяц", "Сутки", "Произвольный период"]
MONTHS: dict[str, int] = {
    "январь": 1,
    "февраль": 2,
    "март": 3,
    "апрель": 4,
    "май": 5,
    "июнь": 6,
    "июль": 7,
    "август": 8,
    "сентябрь": 9,
    "октябрь": 10,
    "ноябрь": 11,
    "декабрь": 12,
}
OFFICIAL_HOLIDAYS: dict[tuple[int, int],  str] = {
    (1, 1): "Новогодние каникулы",
    (1, 2): "Новогодние каникулы",
    (1, 3): "Новогодние каникулы",
    (1, 4): "Новогодние каникулы",
    (1, 5): "Новогодние каникулы",
    (1, 6): "Новогодние каникулы",
    (1, 7): "Рождество Христово",
    (1, 8): "Новогодние каникулы",
    (2, 23): "День защитника Отечества",
    (3, 8): "Международный женский день",
    (5, 1): "Праздник Весны и Труда",
    (5, 9): "День Победы",
    (6, 12): "День России",
    (11, 4): "День народного единства",
}